<template>
	<div class="description">
		<p>Алиса и Боб используют библиотечный компьютер. Алисе нужно передать 
			Бобу важную информацию в зашифрованном виде (некоторое число \(x\)), но Боб 
			придет только через два часа! Алиса может сохранить на компьютере лишь 
			натуральное число не превосходящее \(10^9\). Однако ещё есть вредный системный администратор. 
			Ему не нравится, что всякие Алисы и Бобы сохраняют свои числа на общественный компьютер,  
			поэтому он может умножить число, сохраненное на компьютере, на любое простое число, не 
			превосходящее \(10^9\). Помогите Алисе придумать такой алгоритм, чтобы по числу, возможно
			 испорченному системным администратором, Боб смог бы восстановить изначальное число! <br>
			Это задача с двойным запуском. Это значит, что Ваш код будет запущен два раза. </p>
			<p>	<b>Первый запуск:</b>
				В первый раз на вход будет подано два числа, разделенных пробелом: 
				\(t\) \((t=1)\) - номер запуска и \(x\) \((1 \leq x \leq 10^4)\) - число, которое нужно передать Бобу.
			В ответ программа должна вывести ровно одно число, не превосходящее \(10^9\) - то число, 
			которое Алиса сохранит на компьютере.</p>
			<p><b>Второй запуск:</b>
				На втором запуске в программу также будет подано два числа, разделенных пробелом: 
				\(t\) \((t=2)\) - номер запуска и \(y\) - число, которое прочитает Боб, когда сядет за компьютер. 
				В ответ программа должна вывести то число, которое хотела передать Бобу Алиса (число 
				\(x\), которое вводилось в первый раз)</p>
	</div>
</template>

<style scoped>
.description {
	display: flex;
	flex-direction: column;
	gap: 10px;
}
</style>
