<template>
	<section id="KvantlandTeamInfoSection">
		<TeamInfo :team-info-cards="teamInfo" />
	</section>
</template>

<script>
import TeamInfo from '../index-page/TeamInfo/TeamInfo.vue';
export default {
	components: {
		TeamInfo,
	},
	data() {
		return {
			teamInfo: [
				{
					type: "personal",
					id: "M_Evdokimov",
					name: "Михаил Евдокимов",
					desc: `Автор многих олимпиадных задач по математике: Турнир Городов, 
											Московская олимпиада, Всероссийская, Матпраздник и других.<br/><br/>
								Автор книг «Сто граней математики» и «От задачек к задачам», один из 
								авторов журнала «Квантик».`,
					image: "M_Evdokimov.png",
				},
			
				{
					type: "personal",
					id: "A_Shapovalov",
					name: "Александр Шаповалов",
					desc: `Автор дюжины книг по кружковой и олимпиадной математике, автор 
											около 1000 олимпиадных задач.<br/><br/> Преподаватель летних 
								школ и онлайн-кружков, ответственный редактор серии «Школьные 
								математические кружки».`,
					image: "A_Shapovalov.png",
				},
			
				{
					type: "personal",
					id: "A_Gribalco",
					name: "Александр Грибалко",
					desc: `Автор многих олимпиадных задач по математике: Турнир Городов, 
											Московская олимпиада, Матпраздник и других.<br/><br/>Председатель 
								жюри турнира математических боев имени А.П. Савина. Автор трех 
								книг по материалам турнира.`,
					image: "A_Gribalco.png",
				},
			
				{
					type: "personal",
					id: "E_Bakaev",
					name: "Егор Бакаев",
					desc: `Автор многих олимпиадных задач по математике: Турнир Городов, 
											Московская олимпиада, Всероссийская, Матпраздник и других олимпиад.
								<br/><br/>Преподаватель кружков по олимпиадной математике в ведущих 
								школах Москвы. Редактор журнала “Квант”.`,
					image: "E_Bakaev.png",
				},
			
				{
				type: "personal",
				id: "B_Butyrin",
				name: "Богдан Бутырин",
				desc: `Автор олимпиадных задач по математике: Турнир Городов, Московская 
										олимпиада. Призёр Всероссийской олимпиады.<br/><br/>Автор Youtube-канала 
							MathOlymp, студент ФКН ВШЭ.`,
				image: "B_Butyrin.png",
				},
			
				{
					type: "list",
					id: "DevTeam",
					desc:
						[
							{
								title: "Редакторы",
								team_members: ["С. Дориченко", "Г. Мерзон", "Т. Корчемкина", "М. Прасолов"]
							},
							{
								title: "IT",
								team_members: ["Д. Чертоляс", "В. Аксенов", "Д. Миронов", "В. Лобачевский"]
							},
							{
								title: "Дизайнер",
								team_members: ["А.Москаленко"]
							},
							{
								title: "Художник",
								team_members: ["А.Вайнер"]
							},
						]
				}
			]
		}
	}
}
</script>