<template>
	<ProgramTypeDescription :input-examples="inputExamples">
		<ClientOnly>
		<p>
			Недалеко от дома Медведя растет \(K\) кустов с ягодами, пронумерованных натуральными 
			числами от \(1\) до \(K\). Маша, как и Медведь, очень любит ягоды, и поэтому она заранее 
			определила для каждого куста \(i\) число единиц счастья, которое принесут ей ягоды, 
			которые она съест с этого куста – назовем данную величину ценностью куста \(i\).
		</p>
		<p> И вот настал день, когда все ягоды созрели. Самое время приступать к трапезе, 
			поэтому Маша и Медведь договорились действовать так: </p>
		<ul style="padding-left: 2rem; margin-top: 1rem; margin-bottom: 1rem;">
			<li> Маша утром очередного дня может произвольным образом выбрать не 
				более \(A\) кустов (она все-таки хрупкая девочка, а не какой-нибудь медведь) и 
				съесть все ягоды, которые на них выросли. От этого Маша станет счастливее на 
				сумму ценностей выбранных кустов. </li>
			<li> Медведь вечером каждого дня съедает все оставшиеся ягоды на \(M\) кустах, 
				начиная с первого и по порядку (в первый вечер Медведь проверит кусты с номерами 
				от \(1\) до \(M\), во второй вечер – кусты с номерами от \(M + 1\) до \(2 \cdot M\) и так далее). </li>
		</ul>
		<p> 
			К сожалению, спустя \(N\) дней сезон ягод кончится, и поэтому Маше и Медведю придется
			возвращаться к обычному ритму жизни без вкусных ягод. Помогите Маше выбрать 
			стратегию поедания ягод так, чтобы спустя \(N\) дней суммарная ценность съеденных 
			кустов была бы наибольшей. 
		</p>
		<p> <b> Входные данные: </b> <br> В первой строке содержится \(4\) числа, разделенных пробелом: 
			\(K~ (1 \leq K \leq 10^4)\) - число кустов с ягодами, \(N~ (1 \leq N \leq 100)\) - число дней, через которое 
			закончится сезон ягод, \(A~ (1 \leq A \leq K)\) и \(M~ (1 \leq M \leq K)\). Во второй строке содержится \(K\) чисел 
			\(a_i~ (1 \leq a_i \leq 10^9)\) - ценность \(i\)-го куста. </p>
		<p> <b> Выходные данные: </b> <br> Выходные данные должны содержать \(N\) строк. На \(k\)-ой строке 
			выведите сначала \(S_k~ (0 \leq S_k \leq A)\) - число кустов, с которых Маша будет есть ягоды в 
			день \(k\), а дальше в той же строке \(S_k\) чисел - номера кустов, ягоды с которых Маша будет 
			есть в \(k\)-ый день.
		</p>
      
    <p> <b> Замечание: </b> <br> В этой задаче можно набрать частичные баллы. Для этого решение должно пройти все тесты одной подгруппы с дополнительными условиями (баллы за разные подгруппы суммируются):
      <table>
    <thead>
        <tr>
            <th>Ограничение на подгруппу</th>
            <th>Квантики за подгруппу</th>
        </tr>
    </thead>
        <tbody>
        <tr>
            <td>\(a < m\)<\td>
            <td>\(1\)</td>
        </tr>
        <tr>
            <td>Кусты расположены в порядке не убывания числа ягод на них</td>
            <td>\(1\)</td>
        </tr>
        <tr>
            <td>Кусты расположены в порядке не возрастания числа ягод на них</td>
            <td>\(1\)</td>
        </tr>
        <tr>
            <td>\(k \leq 1000\)</td>
            <td>\(1\)</td>
        </tr>
        </tbody>
    </table>
		</p>
		</ClientOnly>
	</ProgramTypeDescription>
</template>

<script>
export default {
	data() {
		return {
			inputExamples: [
				{'input': ['6 1 3 3', '2 3 4 5 7 9'], 'output': ['3 4 5 6']},
				{'input': ['6 2 3 3', '10 8 6 6 2 7'], 'output': ['3 1 2 3', '3 4 5 6']}
			]
		}
	}
}
</script>
