def description(params):
	return '''
		Мальчик Иннокентий очень любит школьные уроки информатики, потому научился мыслить только в терминах логических выражений. 
		Иннокентий также очень любит гулять на улице, однако Мама Иннокентия, Мария Ивановна, сформулировала правило, 
		когда ему разрешается выходить на улицу (не удивляйтесь, мама Иннокентия тоже учила логику, но в гуманитарном университете): 
		Иннокентий может выйти погулять в следующих случаях:
		Помогите Иннокентию составить логическое выражение, которое должно быть истинным тогда и только тогда, когда ему можно выходить на прогулку. 
		Вам доступны операции “и”, “или”, “не”, “”
		'''