<template>
	<ProgramTypeDescription :input-examples="inputExamples">
		<ClientOnly>
		<p>Два автомобилиста движутся по кольцевой дороге длины \(L\) км в противоположных направлениях. 
			Они начинают движение из одной точки и едут с постоянными скоростями \(v_1\) и \(v_2\) 
			соответственно (в км/ч). Однако спустя \(T\) часов движения они мгновенно увеличивают 
			свои скорости на \(20\) км/ч (далее скорости автомобилистов постоянны).  </p>
		<p> Требуется определить, на каком расстоянии друг от друга они окажутся в момент времени
			\(Q\) часов <i>(отсчитывается в часах от момента, когда автомобили были в одной точке)</i>. Под расстоянием имеется в виду длина наименьшей дуги между автомобилистами. </p>
		<p><b>Входные данные:</b><br> Вводятся числа  \(L, v_1, v_2, T, Q\). Все числа натуральные и не превосходят \(10^9\).</p>
		<p><b>Выходные данные:</b><br> Натуральное число, равное требуемому расстоянию между автомобилистами в момент времени \(Q\).</p>
		</ClientOnly>
	</ProgramTypeDescription>
</template>

<script>
import ProgramTypeDescription from '../programType/components/ProgramTypeDescription.vue';

export default {
	components: {
		ProgramTypeDescription,
	},
	data() {
		return {
			inputExamples:  [
				{'input': ['100 2 3 2 5'], 'output': ['5']},
				{'input': ['108 70 80 2 4'], 'output': ['40']}
			]
		}
	}
}
</script>
