<template>
	<ClientOnly>
		<div class="description">
		Сыграйте с компьютером в игру!
		Перед вами квадратное шахматное поле \(10 \times 10\), на некоторых клетках которого стоят шахматные кони. 
		В левом нижнем углу доски стоит ферзь. За один ход игрокам по очереди разрешается передвинуть 
		ферзя на произвольное число клеток либо вправо по горизонтали, либо вверх по вертикали, либо вправо-вверх 
		по диагонали. Однако запрещено “перепрыгивать” или съедать коней, а также останавливаться в клетках, которые бьют кони. 
		Проигрывает тот, кто не сможет сделать ход. Вы можете выбрать, ходить первым или вторым. 
		Не упустите возможность и выиграйте у компьютера!
	</div>
	</ClientOnly>
</template>
