<template>
	<ProgramTypeDescription :input-examples="inputExamples">
		<ClientOnly>
		<div>	Празднуя свой \(27\) день рождения, Неразборчивая Принцесса по имени Изольда поняла, 
			что пора ей выходить замуж, причем делать это надо в течение года, ведь часики-то тикают! 
			<a
				href="https://ru.wikipedia.org/wiki/Задача_о_разборчивой_невесте" 
				target="_blank" style="color: blue; text-decoration: underline;">Как известно</a>, 
			выходить замуж надо по правилу \(37\%\): сначала надо понять, со сколькими принцами 
			Изольда успеет познакомиться (обозначим это число за \(N\)), познакомиться с \(37\%\) из них, а потом продолжить знакомиться с 
			принцами и выходить замуж за того, который будет лучше всех предыдущих. В случае, если \(37\%\) от \(N\) не является целым числом, необходимо округлять его вниз до ближайшего целого числа. </div>
		<div> Изольда оценивает каждого принца по \(4\) параметрам: рост, вес, красота и богатство 
			по \(100\)-балльной системе (все характеристики являются целыми числами от \(0\) до \(100\))
			 и выбирает для себя принца, у которого сумма характеристик является наибольшей. </div>
		<div> В этой истории Вы - Купидон. Вы можете переупорядочить все знакомства любым образом 
			(добавить новые или убрать старые не получится - от судьбы не уйдешь!), однако
			 даже Вы не знаете, какие принцы согласятся жениться на Изольде. Переупорядочьте 
			 знакомства так, чтобы Изольда точно нашла себе лучшего мужа. </div>
		<div> Гарантируется, что среди \(63\%\) лучших принцев хотя бы один согласится жениться на Изольде.</div>
		<div> <b> Входные данные: </b> <br> В первой строке вводятся число \(N\) \((1 \leq N \leq 10^5)\) - количество принцев, 
			с которыми встретится Изольда в этом году. Далее идут \(N\) строк по \(4\) числа в каждой - параметры принцев. </div>
		<div> <b> Выходные данные: </b> <br> Выведите \(N\) чисел \(p_i\) - перестановку чисел от \(1\) до \(N\), 
			которая показывает, в каком порядке Купидону надо переставить претенденток, чтобы Изольда 
			была как можно счастливее. Если существует несколько вариантов, при которых Изольда получает 
			лучшего мужа, то выведите любой. </div>
    <div> <b> Замечание: </b> <br> В данной задаче есть возможность получить частичный балл: решения, которые проходят тесты для \(1 \leq N \leq 1000\), получают \(1\) квантик. </div>
		</ClientOnly>
	</ProgramTypeDescription>
</template>

<script>
import ProgramTypeDescription from '../../../common/programType/components/ProgramTypeDescription.vue';

export default {
	components: {
		ProgramTypeDescription,
	},
	data() {
		return {
			inputExamples: [
				{'input': ['4', '1 0 0 0', '0 2 0 2', '0 1 0 1', '1 0 1 1'], 'output': ['1 2 4 3']}
			]
		}
	}
}
</script>
