<template>
	<div>
		У ученого есть робот для переливания жидкостей, а также колбы с жидкостями, 
		содержащие {{ config[0] }} мл, {{ config[1] }} мл, {{ config[2] }} мл, 
		{{ config[3] }} мл и {{ config[4] }} мл особого раствора. Он хочет уровнять 
		объемы в колбах, дотронувшись до как можно меньшего количества колб. 
		Как это сделать? За один раз робот берет одну колбу и переливает часть жидкости 
		(он может отмерять ее сколь угодно точно!) в одну или несколько других колб. 
	</div>
</template>

<script>
export default {
	props: ["problemParams"],
	computed: {
		config() {
			return this.problemParams.current_config
		}
	}
}
</script>