<template>
	<div>
		У ученого есть робот для переливания жидкостей, а также колбы с жидкостями, 
		содержащие {{ config[0] }} мл, {{ config[1] }} мл, {{ config[2] }} мл, 
		{{ config[3] }} мл и {{ config[4] }} мл особого раствора. Он хочет уровнять 
		объемы в колбах, дотронувшись до как можно меньшего количества колб. Как это сделать? 
		За одно переливание выделяем две колбы откуда и куда переливаем, вводим целое число мл, 
		которое хотим перелить, и нажимаем кнопку “Enter”. Каждая колба вмещает не более 12 мл. 
		Кнопку “Отправить” нужно нажать лишь после того, как уравняли объёмы во всех колбах.
	</div>
</template>

<script>
export default {
	props: ["problemParams"],
	computed: {
		config() {
			return this.problemParams.current_config
		}
	}
}
</script>