<template>
	<ClientOnly>
	<div class="description">
		<p> Вы - капитан космического флота. Разведка перехватила сообщение, 
		из которого понятно, что в скоплении Квадрат потерпел крушение корабль 
		пришельцев с ценной информацией. Вы должны определить звездную систему, 
		в которой разбился корабль! Скопление Квадрат называется так, поскольку 
		его звездные системы упорядочены и находятся в центрах единичных 
		квадратов, на которые разбивается скопление. Его размеры - \(10 \times 10\). К сожалению, 
		у Вас истощились запасы и для поиска осталось всего \(7\) дронов-разведчиков. </p>
		<p> Каждый дрон-разведчик может просканировать какую-то прямоугольную область и 
		передать лишь одно сообщение, есть в этой области корабль или нет. После этого 
		дрон перегревается и больше не работает. Найдите корабль! </p> 
    <p> Чтобы задать область для сканирования, нужно мышкой выделить её нижнюю левую и верхнюю правую клетки. 
      После использования всех дронов необходимо выделить искомую клетку с кораблём пришельцев.
    </p>
	</div>
	</ClientOnly>
</template>

<style scoped>
.description {
	display: inline-flex;
	flex-direction: column;
	gap: 1em;
}
</style>
