<template>
	<p style="white-space: pre-line;">
		Дети шли взвешиваться и высказывали друг другу предположения. В результате оказалось, что все веса детей различны и каждая девочка легче каждого мальчика. Кроме того, высказанное лицу другого пола оказалось неверным, а своего пола – верным. Сохранились реплики четверых из них, обращённые друг к другу.
		Миша – Саше: «Я легче Вали».
		Саша – Вале: «Я легче Жени».
		Валя – Жене: «Я легче Миши».
		Женя – Мише: «Я легче Саши».

		<b>Определите пол Вали, Жени и Саши и перетащите табличку с именем в соответствующую группу.</b>
	</p>
</template>