<template>
	<ProgramTypeDescription :input-examples="inputExamples">
		<p>В этой задаче Вам необходимо написать программу, которая будет играть с компьютером в игру.<br>
		Перед Вами три одинаковые бочки, в каждой из которых есть некоторое количество воды. <br>
		Вы играете против компьютера и ходите первым. За одно действие разрешается перелить \(1\) литр из бочки с 
			меньшим номером в бочку с большим номером. Проигрывает тот, кто не может сделать ход. <br>
		Вам необходимо либо выиграть у компьютера, либо заранее сообщить, что у компьютера выиграть невозможно!<br>
		Изначально в первой бочке налито \(a\) литров воды, во второй – \(b\) литров, в третьей – \(c\) литров. <br></p>
		<p><b>Входные и выходные данные:</b></p>
		<p> В трех строках вводятся натуральные числа \( a, b, c \) (по одному в строке) \( (0 \leq a, b, c \leq 10^4) \) </p>
		<p> Если у Вас не получится выиграть, выведите \(\mathtt{Impossible.}\) и завершите программу. </p>
		<p> Если же у Вас есть возможность победить, выведите на первой строке \(\mathtt{Possible}\) и начните игру: на следующей строке выведите Ваш первый ход – это два числа \( i \) и \( j \): из \(i\)-ой бочки \(1\) литр переливается в \(j\)-ую бочку – числа \(i, j\) 
			следует выводить на отдельной строке через пробел. </p>
		<p class="notion">Напоминание: изначально в бочке с номером \(1\) содержится \(a\) литров, с номером \(2\) – \(b\) литров, с номером \(3\) – \(c\) литров.</p> 
		<p>За любым Вашим ходом, кроме последнего, последует ответ компьютера – на вход подаются два числа \(1 \leq i < j \leq 3\), записанные через пробел. 
			Это означает, что компьютер перелил \(1\) литр из \(i\)-ой бочки в \(j\)-ую. </p>
		<p>После Вашего победного хода необходимо завершить программу. </p>
	</ProgramTypeDescription>
</template>

<script>
export default {
	data() {
		return {
			inputExamples: [
				{'input': ['3', '0', '0', ' ', ' ', '1 3'], 'output': [' ', ' ', 'Possible', '1 3', ' ', '1 3']},
				{'input': ['0', '5', '5', ' ', ' ', '2 3', ' ', '2 3'], 'output': [' ', ' ', ' ', 'Possible', '2 3', ' ', '2 3', ' ', '2 3']}
			]
		}
	}
}
</script>

<style scoped>
.notion {
	font-weight: 400;
	font-style: italic;
}
</style>
