<template>
	<div>
		Мальчик Иннокентий очень любит школьные уроки информатики, поэтому научился мыслить только в терминах логических выражений. 
		Иннокентий также очень любит гулять на улице, однако Мама Иннокентия, Мария Ивановна, сформулировала правило, 
		когда ему разрешается выходить на улицу (не удивляйтесь, мама Иннокентия тоже учила логику, но в гуманитарном университете): 
		Иннокентий может выйти погулять в следующих случаях:
		<ul style="padding-left: 40px; margin-top: 1em; margin-bottom: 1em;">
			<li>если за окном жарко, то на улицу можно выйти, если светит солнце и нет дождя и ветра одновременно</li>
			<li>если же за окном не жарко, то на улицу можно выйти, если светит солнце или нет ветра, но если светит
			солнце и нет ветра одновременно, то Иннокентию лучше остаться дома.</li>
		</ul>
		Помогите Иннокентию составить логическое выражение, которое должно быть истинным тогда и только тогда, когда ему можно выходить на прогулку. 
		Вам доступны операции <b style="white-space: nowrap;"> и, или, не, xor </b>.
	</div>
</template>
