<template>
	<div>
		Cоберите функцию, которая реализует алгоритм решета Эратосфена по поиску простых чисел
		среди первых \(n\) натуральных чисел. Создается список \(\mathtt{is\_prime}\) длины \(n + 1\), заполненный единицами – 
		изначально мы считаем, что все числа от \(0\) до \(n\) являются простыми, положив \(\mathtt{is\_prime[k] = 1}\) для 
		любого \(k\) от \(0\) до \(n\). Далее мы инициализируем начальные значения: \(\mathtt{is\_prime[0] = is\_prime[1] = 0}\) – мы 
		знаем, что \(0\) и \(1\) не являются простыми числами. После этого перебираем \(k = 2, \dots, n\). 
		Если \(\mathtt{is\_prime[k] = 0}\), 
		то мы пропускаем итерацию. Иначе \(\mathtt{is\_prime[k] = 1}\) и \(k\) заведомо простое. Поэтому мы должны пометить числа 
		\(2k, 3k, \dots\) как достоверно не являющимися простыми (положив \(\mathtt{0 = is\_prime[2k]= is\_prime[3k] = \dots}\)). В самом 
		конце функция должна вернуть список \(\mathtt{is\_prime}\). Перетаскивая блоки справа, расположите их в области слева 
		так, чтобы получилась корректно работающая программа, которая строит решето Эратосфена.
	</div>
</template>
