<template>
	<div>
		Cоберите функцию, которая реализует алгоритм решета Эратосфена по поиску простых чисел
		среди первых \(\mathtt{n}\) натуральных чисел. Создается список \(\mathtt{is\_prime}\) длины \(\mathtt{n + 1}\), заполненный единицами – 
		изначально мы считаем, что все числа от \(\mathtt{0}\) до \(\mathtt{n}\) являются простыми, положив \(\mathtt{is\_prime[k] = 1}\) для 
		любого \(\mathtt{k}\) от \(\mathtt{0}\) до \(\mathtt{n}\). Далее мы инициализируем начальные значения: \(\mathtt{is\_prime[0] = is\_prime[1] = 0}\) – мы 
		знаем, что \(\mathtt{0}\) и \(\mathtt{1}\) не являются простыми числами. После этого перебираем \(\mathtt{k = 2, \dots, n}\). 
		Если \(\mathtt{is\_prime[k] = 0}\), 
		то мы пропускаем итерацию. Иначе \(\mathtt{is\_prime[k] = 1}\) и \(\mathtt{k}\) заведомо простое. Поэтому мы должны пометить числа 
		\(\mathtt{2k, 3k, \dots }\) как достоверно не являющимися простыми (положив \(\mathtt{0 = is\_prime[2k]= is\_prime[3k] = \dots}\)). В самом 
		конце функция должна вернуть список \(\mathtt{is\_prime}\). Перетаскивая блоки справа, расположите их в области слева 
		так, чтобы получилась корректно работающая программа, которая строит решето Эратосфена.
	</div>
</template>