<template>
	<div class="description">
		<div>
			У Васи сегодня экзамен по программированию, но (вот незадача!) компилятор его любимого языка сломался и не работает! 
			Помогите Васе и скомпилируйте программу – переведите ее в набор инструкций, понятный компьютеру. Компьютер понимает 
			базовые операции <b>Add, Sub, ShiftLeft, ShiftRight, Move</b> (описание операций см. ниже). Для вычислений обычно 
			используется восемь основных переменных (регистров), которые называются A, B, C, D, E, F, G, H. Однако в домашнем 
			задании можно использовать только регистры A, B, C, D. Составьте из предложенных операций программу, которая будет 
			работать так же, как программа Васи. Возвращаемый результат необходимо положить в переменную А.
			Вот функция Васи:
		</div>
		<img class="function" src="/problem_assets/vasya_function.png" />
		<div>
			Значения чисел a, b, c изначально сохранены в регистры A, B, C соответственно.
			Количество строк в программе не должно превосходить 10.
		</div>
		<div>
			<b><u>Описание команд:</u></b> <br/>
			<i>Далее буква T может обозначать, как число, так и регистр:</i> <br/>
			<ol style="padding-top:1em; margin-left: 2em">
				<li><b>Add T, X</b> – добавляет значение T к значению регистра X, результат сохраняется в регистре X</li>
				<li><b>Sub T, X</b> – вычитает значение T из значения регистра X, результат сохраняется в регистре X</li>
				<li><b>ShiftLeft T, X</b> – умножает Х на 2^T</li>
				<li><b>ShiftRight T, X</b>  – в Х записывается целая часть при делении Х на 2^T</li>
				<li><b>Move T, X</b> – значение в регистре Х становится равно значению Т</li>
			</ol>
		</div>
	</div>
</template>

<script>
export default {
	props: ['problemParams']
}
</script>

<style scoped>
img.function {
	width: 60%;
	height: auto;
	align-self: center;
}

.description {
	display: flex;
	flex-direction: column;
	gap: 1em;
}
</style>