<template>
	<div class="description">
		<p>	Празднуя свой \(27\) день рождения, Неразборчивая Принцесса по имени Изольда поняла, 
			что пора ей выходить замуж, причем делать это надо в течение года, ведь часики-то тикают! 
			<a href="https://ru.wikipedia.org/wiki/Задача_о_разборчивой_невесте" 
			target="_blank" style="color: blue; text-decoration: underline;">Как известно</a>, 
			выходить замуж надо по правилу \(37\%\): сначала надо понять со сколькими принцами 
			Изольда успеет познакомиться, познакомиться с \(37\%\) из них, а потом продолжить знакомиться с 
			принцами и выходить замуж за того, который будет лучше всех предыдущих. </p>
		<p> Изольда оценивает каждого принца по \(4\) параметрам: рост, вес, красота и богатство 
			по \(100\)-балльной системе (все характеристики являются целыми числами от \(0\) до \(100\))
			 и выбирает для себя принца, у которого сумма характеристик является наибольшей. </p>
		<p> В этой истории Вы - Купидон. Вы можете переупорядочить все знакомства любым образом 
			(добавить новые или убрать старые не получится - от судьбы не уйдешь!), однако
			 даже Вы не знаете какие принцы согласятся жениться на Изольде. Переупорядочьте 
			 знакомства так, чтобы Изольда точно нашла себе лучшего мужа. </p>
		<p> Гарантируется, что среди \(63\%\) лучших принцев хотя бы один согласится жениться на Изольде.</p>
		<p> <b> Входные данные: </b> <br> В первой строке вводятся число \(N\) \((1 \leq N \leq 10^5)\) - количество принцев, 
			с которыми встретится Изольда в этом году. Далее идут \(N\) строк по \(4\) числа в каждой - параметры претендентов. </p>
		<p> <b> Выходные данные: </b> <br> Выведите \(N\) чисел \(p_i\) - перестановку чисел от \(1\) до \(N}\), 
			которая показывает, в каком порядке Купидону надо переставить претенденток, чтобы Изольда 
			была как можно счастливее. Если существует несколько вариантов при которых Изольда получает 
			лучшего мужа, то выведите любой. </p>

	</div>
</template>

<style scoped>
.description{
	display: flex;
	flex-direction: column;
	gap: 10px;
}
</style>
